# Combining DataFrames

### Import pandas

In [2]:
import pandas as pd

### Read CSV

In [3]:
from pathlib import Path
p1 = Path('C:/Users/alouden01/Documents/python-pandas-for-data-manipulation/starter_files/skill_16_joining_merging/cafe_customers.csv')
customers = pd.read_csv(p1)
customers.head()

,id,first_name,last_name,email,gender,payment
0,1,Rogerio,Sercombe,rsercombe0@utexas.edu,Female,card
1,2,Lauri,Bonicelli,lbonicelli1@123-reg.co.uk,Male,card
2,3,Bethanne,Barendtsen,bbarendtsen2@etsy.com,Female,card
3,4,Derrik,Perroni,dperroni3@smugmug.com,Female,cash
4,5,Kizzee,Plaxton,kplaxton4@fema.gov,Female,gift_certificate

In [4]:
root = p1.parent
items = pd.read_csv(root / 'cafe_items.csv')
items.head()

   item_id       item  prices
0        1      latte       3
1        2     muffin       4
2        3   lemonade       3
3        4      latte       2
4        5  chocolate       2

In [ ]:
week1 = pd.read_csv(root / 'cafe_week_1_sales.csv')
week2 = pd.read_csv(root / 'cafe_week_2_sales.csv')
week1.head()

   cust_id  item_id
0      483        1
1      263        1
2      146        1
3      933        4
4      768        3

In [8]:
week2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   cust_id  250 non-null    int64
 1   item_id  250 non-null    int64
dtypes: int64(2)
memory usage: 4.0 KB

In [15]:
# concat week1 and week2
both_weeks = pd.concat(objs=[week1,week2], keys=['week1','week2'] )
both_weeks.head()

         cust_id  item_id
week1 0      483        1
      1      263        1
      2      146        1
      3      933        4
      4      768        3

In [16]:
both_weeks.tail()

           cust_id  item_id
week2 245      940        6
      246      149        5
      247      545        7
      248      301        7
      249      134       10

In [17]:
sales = pd.concat([week1,week2],keys=['week1','week2'])
sales.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 500 entries, ('week1', 0) to ('week2', 249)
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   cust_id  500 non-null    int64
 1   item_id  500 non-null    int64
dtypes: int64(2)
memory usage: 9.6+ KB

In [21]:
sales.loc['week1']

     cust_id  item_id
0        483        1
1        263        1
2        146        1
3        933        4
4        768        3
..       ...      ...
245      669        2
246      171       10
247      836        1
248      786        3
249      281        6

[250 rows x 2 columns]

In [ ]:
# week1 and week2 are keys, you can access them with the index
# in different syntaxs
# syntax 1
sales.loc[('week1',2)]

cust_id    146
item_id      1
Name: (week1, 2), dtype: int64

In [24]:
#syntax 2
sales.loc[('week1'),2]

cust_id    146
item_id      1
Name: (week1, 2), dtype: int64

In [25]:
# syntax 3 - this is getting stupid
sales.loc['week1',2]

cust_id    146
item_id      1
Name: (week1, 2), dtype: int64

In [26]:
# also multiple syntaxs
sales.loc['week1',2]['cust_id']

np.int64(146)

In [27]:
# the ide likes this one the best
sales.loc[('week1', 2), 'cust_id']

np.int64(146)

In [31]:
sales.loc[('week1',2)]['cust_id']

np.int64(146)